fQwQf/A20OS/kernel/platform/stm32f103/peripherals.c
static void ui_render_cat_frame(void) {
    if (!g_ui_ready || g_cal_active || g_page != PAGE_HOME ||
        !peripherals.display_ready)
        return;
    if (!live2d_load_draw(&g_ui_gfx, &g_cat))
        ui_render_cat(&g_ui_gfx, &g_ui_model, &g_cat);
}

static void ui_manual_arm(uint8_t mask, uint64_t now) {
    g_manual_mask |= mask;
    g_manual_until = now + MANUAL_OVERRIDE_MS;
}

static void ui_apply_action(ui_action_t action, uint64_t now) {
    if (action == UI_ACTION_NONE)
        return;
    if (action == UI_ACTION_FAN_UP || action == UI_ACTION_FAN_DOWN) {
        int level = g_ui_state.fan_level;
        level += action == UI_ACTION_FAN_UP ? 1 : -1;
        if (level < 0)
            level = 0;
        if (level > 3)
            level = 3;
        g_manual_fan = (uint8_t)level;
        g_ui_state.fan_level = g_manual_fan;
        stm32_fan_set_level(g_manual_fan);
        ui_manual_arm(MANUAL_FAN, now);
    } else if (action == UI_ACTION_PUMP_TOGGLE) {
        g_manual_pump = g_ui_state.pump_on ? 0U : 1U;
        g_ui_state.pump_on = g_manual_pump;
        stm32_pump_set(g_manual_pump);
        ui_manual_arm(MANUAL_PUMP, now);
    } else if (action == UI_ACTION_THEME_CYCLE) {
        g_manual_theme = (uint8_t)((g_ui_state.theme + 1U) % 3U);
        g_ui_state.theme = g_manual_theme;
        ui_manual_arm(MANUAL_THEME, now);
    } else if (action == UI_ACTION_LIGHT_UP || action == UI_ACTION_LIGHT_DOWN) {
        int pct = (int)g_backlight;
        pct += action == UI_ACTION_LIGHT_UP ? (int)BACKLIGHT_STEP
                                            : -(int)BACKLIGHT_STEP;
        if (pct < 0)
            pct = 0;
        if (pct > 100)
            pct = 100;
        g_manual_backlight = (uint8_t)pct;
        g_backlight = g_manual_backlight;
        g_ui_state.backlight = g_manual_backlight;
        stm32_light_sensor_set_manual_brightness(g_manual_backlight);
        ui_manual_arm(MANUAL_BACKLIGHT, now);
    } else if (action == UI_ACTION_MENU) {
        g_page = g_page == PAGE_HOME ? PAGE_DIAG : PAGE_HOME;
        g_ui_ready = 0;
    } else if (action == UI_ACTION_TALK) {
        /*
         * Replay the current line, and ask the proxy for a new one. The cloud
         * is otherwise only asked on a real change or a slow heartbeat
         * (cloud_should_ask), so this is what makes tapping her feel like
         * asking a question. Speech is never invented here.
         */
        live2d_speak(&g_cat, g_ui_state.speech, (uint32_t)now);
        cloud_ask_now = 1;
        last_control_tick = 0;
    }
    g_ui_state.manual_mask = g_manual_mask;
    hub_buzz(now, BUZZ_INPUT_MS);
    ui_render_full();
}

/*
 * Long-press a control -> hand it straight back to the rule engine. Tapping a
 * card takes manual ownership for MANUAL_OVERRIDE_MS (10 min); without this
 * there is no way to give it back early and the card just sits on MANU. Returns
 * 1 when it released one, 0 to let the normal tap action run instead.
 */
static int ui_release_manual(ui_action_t action, uint64_t now) {
    uint8_t bit = 0;

    if (action == UI_ACTION_FAN_UP || action == UI_ACTION_FAN_DOWN)
        bit = MANUAL_FAN;
    else if (action == UI_ACTION_LIGHT_UP || action == UI_ACTION_LIGHT_DOWN)
        bit = MANUAL_BACKLIGHT;
    else if (action == UI_ACTION_PUMP_TOGGLE)
        bit = MANUAL_PUMP;
    else if (action == UI_ACTION_THEME_CYCLE)
        bit = MANUAL_THEME;
    if (!bit || !(g_manual_mask & bit))
        return 0;
    g_manual_mask &= (uint8_t)~bit;
    g_ui_state.manual_mask = g_manual_mask;
    last_control_tick = 0; /* let the rule engine retake it now, not in 2s */
    hub_buzz(now, BUZZ_INPUT_MS);
    printf("[TOUCH] long-press -> auto (manual mask=0x%x)\n",
           (unsigned)g_manual_mask);
    ui_render_full();
    return 1;
}

/* Diagnostics-page buttons. CAL and the two radio pokes are here rather than
 * on the home screen because they interrupt what the hub is doing. */
static void apply_diag_action(ui_diag_action_t action, uint64_t now) {
    if (action == UI_DIAG_ACTION_NONE)
        return;
    hub_buzz(now, BUZZ_INPUT_MS);
    switch (action) {
    case UI_DIAG_ACTION_BACK:
        g_page = PAGE_HOME;
        g_ui_ready = 0;
        ui_render_full();
        break;
    case UI_DIAG_ACTION_CALIBRATE:
        /* Calibration owns the whole panel and returns to the home screen. */
        g_page = PAGE_HOME;
        g_ui_ready = 0;
        (void)stm32_peripherals_start_touch_calibration();
        break;
    case UI_DIAG_ACTION_WIFI_SCAN:
        if (stm32_wifi_scan() == 0)
            printf("[WIFI] AP scan started\n");
        ui_render_full();
        break;
    case UI_DIAG_ACTION_BT_TEST: {
        static const char message[] = "A20OS HC05 TEST\r\n";
        if (peripherals.bluetooth_ready &&
            stm32_bluetooth_send(message, sizeof(message) - 1U) == 0)
            printf("[BT] sent test message\n");
        ui_render_full();
        break;
    }
    default:
        break;
    }
}

static ui_action_t ui_action_from_ir(int action) {
    if (action == IR_ACT_FAN_UP)
        return UI_ACTION_FAN_UP;
    if (action == IR_ACT_FAN_DOWN)
        return UI_ACTION_FAN_DOWN;
    if (action == IR_ACT_PUMP_TOGGLE)
        return UI_ACTION_PUMP_TOGGLE;
    if (action == IR_ACT_THEME_CYCLE)
        return UI_ACTION_THEME_CYCLE;
    if (action == IR_ACT_TALK)
        return UI_ACTION_TALK;
    if (action == IR_ACT_MENU)
        return UI_ACTION_MENU;
    if (action == IR_ACT_LIGHT_UP)
        return UI_ACTION_LIGHT_UP;
    if (action == IR_ACT_LIGHT_DOWN)
        return UI_ACTION_LIGHT_DOWN;
    return UI_ACTION_NONE;
}

static ui_action_t ui_action_from_key(stm32_key_t key) {
    if (key == STM32_KEY_UP)
        return UI_ACTION_FAN_UP;
    if (key == STM32_KEY_DOWN)
        return UI_ACTION_FAN_DOWN;
    if (key == STM32_KEY_LEFT)
        return UI_ACTION_PUMP_TOGGLE;
    if (key == STM32_KEY_RIGHT)
        return UI_ACTION_THEME_CYCLE;
    return UI_ACTION_NONE;
}

/* One dispatcher for every remote input (IR, Bluetooth, direction keys), so
 * they cannot drift apart. MUTE is handled here because it drives the buzzer
 * rather than the UI model. */
static void apply_remote_action(int action, uint64_t now) {
    if (action == IR_ACT_NONE)
        return;
    if (action == IR_ACT_MUTE_BUZZER) {
        buzzer_muted = !buzzer_muted;
        if (buzzer_muted) {
            stm32_buzzer_set(0);
            buzzer_active = 0;
        } else {
            hub_buzz(now, BUZZ_INPUT_MS);
        }
        printf("[IN] buzzer=%s\n", buzzer_muted ? "muted" : "on");
        return;
    }
    ui_apply_action(ui_action_from_ir(action), now);
}

