fQwQf/A20OS/kernel/platform/stm32f103/peripherals.c
static void ui_handle_bluetooth_command(const char *line, uint64_t now) {
    bluetooth_cmd_t cmd;
    int redraw = 1;
    static const char help[] =
        "HELP 1..9 STATUS PING | FAN 0..3 | PUMP ON/OFF | "
        "THEME DAY/NIGHT/COZY | LIGHT 0..100 | MUTE ON/OFF | "
        "AUTO FAN/PUMP/THEME/LIGHT/ALL\r\n";

    if (!stm32_bluetooth_connected())
        return;
    if (bluetooth_cmd_parse(line, &cmd) != 0) {
        static const char error[] = "ERR unknown command; send HELP\r\n";
        (void)stm32_bluetooth_send(error, sizeof(error) - 1U);
        return;
    }
    if (cmd.kind == BLUETOOTH_CMD_HELP) {
        (void)stm32_bluetooth_send(help, sizeof(help) - 1U);
        return;
    }
    if (cmd.kind == BLUETOOTH_CMD_PING) {
        static const char pong[] = "PONG A20OS\r\n";
        (void)stm32_bluetooth_send(pong, sizeof(pong) - 1U);
        return;
    }
    if (cmd.kind == BLUETOOTH_CMD_STATUS) {
        char status[128];
        int n = snprintf(status, sizeof(status),
            "STATUS T=%d H=%u L=%u FAN=%u PUMP=%u BL=%u THEME=%s "
            "MODE=%02x MUTE=%u NET=%s\r\n",
            (int)g_ui_state.temp_c, (unsigned)g_ui_state.humidity,
            (unsigned)g_ui_state.light, (unsigned)g_ui_state.fan_level,
            (unsigned)g_ui_state.pump_on, (unsigned)g_ui_state.backlight,
            env_theme_name((env_theme_t)g_ui_state.theme),
            (unsigned)g_manual_mask, (unsigned)buzzer_muted,
            g_ui_state.net_cloud ? "CLOUD" : "LOCAL");
        if (n > 0)
            (void)stm32_bluetooth_send(status,
                (size_t)n < sizeof(status) ? (size_t)n : sizeof(status) - 1U);
        return;
    }
    if (cmd.kind == BLUETOOTH_CMD_ACTION) {
        apply_remote_action(cmd.value, now);
        redraw = 0; /* UI actions already repaint; MUTE has nothing to repaint. */
    } else if (cmd.kind == BLUETOOTH_CMD_FAN_SET) {
        g_manual_fan = g_ui_state.fan_level = (uint8_t)cmd.value;
        stm32_fan_set_level(g_manual_fan);
        ui_manual_arm(MANUAL_FAN, now);
    } else if (cmd.kind == BLUETOOTH_CMD_PUMP_SET) {
        g_manual_pump = g_ui_state.pump_on = (uint8_t)cmd.value;
        stm32_pump_set(g_manual_pump);
        ui_manual_arm(MANUAL_PUMP, now);
    } else if (cmd.kind == BLUETOOTH_CMD_THEME_SET) {
        g_manual_theme = g_ui_state.theme = (uint8_t)cmd.value;
        ui_manual_arm(MANUAL_THEME, now);
    } else if (cmd.kind == BLUETOOTH_CMD_LIGHT_SET) {
        g_manual_backlight = g_backlight = g_ui_state.backlight =
            (uint8_t)cmd.value;
        stm32_light_sensor_set_manual_brightness(g_manual_backlight);
        ui_manual_arm(MANUAL_BACKLIGHT, now);
    } else if (cmd.kind == BLUETOOTH_CMD_MUTE_SET) {
        buzzer_muted = cmd.value;
        if (buzzer_muted) {
            stm32_buzzer_set(0);
            buzzer_active = 0;
        }
    } else if (cmd.kind == BLUETOOTH_CMD_AUTO) {
        g_manual_mask &= (uint8_t)~cmd.value;
        g_ui_state.manual_mask = g_manual_mask;
        last_control_tick = 0;
    }
    g_ui_state.manual_mask = g_manual_mask;
    if (redraw)
        ui_render_full();
    {
        static const char ok[] = "OK\r\n";
        (void)stm32_bluetooth_send(ok, sizeof(ok) - 1U);
    }
}

static void touch_calibration_render(void) {
    ui_render_cal_target(&g_ui_gfx, (int)g_cal_index, 4);
}

int stm32_peripherals_start_touch_calibration(void) {
    if (!peripherals.display_ready || !peripherals.touch_armed)
        return -1;
    g_cal_index = 0;
    g_cal_active = 1;
    g_cal_pressed = 0;
    touch_pressed = 0;
    g_cal_raw_x_sum = 0;
    g_cal_raw_y_sum = 0;
    g_cal_sample_count = 0;
    g_cal_release_count = 0;
    touch_calibration_render();
    return 0;
}

static void touch_calibration_service(void) {
    static const uint16_t sx[4] = {
        UI_RENDER_CAL_INSET, UI_RENDER_W - UI_RENDER_CAL_INSET,
        UI_RENDER_CAL_INSET, UI_RENDER_W - UI_RENDER_CAL_INSET,
    };
    static const uint16_t sy[4] = {
        UI_RENDER_CAL_INSET, UI_RENDER_CAL_INSET,
        UI_RENDER_H - UI_RENDER_CAL_INSET,
        UI_RENDER_H - UI_RENDER_CAL_INSET,
    };
    uint16_t raw_x = 0;
    uint16_t raw_y = 0;
    int sample_valid = stm32_touch_poll_raw(&raw_x, &raw_y);
    int pressed = stm32_touch_pressed();

    if (sample_valid) {
        g_cal_release_count = 0;
        if (!g_cal_pressed) {
            g_cal_raw_x_sum = 0;
            g_cal_raw_y_sum = 0;
            g_cal_sample_count = 0;
        }
        if (g_cal_sample_count < 64U) {
            g_cal_raw_x_sum += raw_x;
            g_cal_raw_y_sum += raw_y;
            g_cal_sample_count++;
        }
    } else if (!pressed && g_cal_pressed && g_cal_release_count < 3U) {
        g_cal_release_count++;
        if (g_cal_release_count < 3U)
            return;
    }
    if (!pressed && g_cal_pressed) {
        if (g_cal_sample_count >= 5U) {
            g_cal_points[g_cal_index].raw_x =
                (uint16_t)(g_cal_raw_x_sum / g_cal_sample_count);
            g_cal_points[g_cal_index].raw_y =
                (uint16_t)(g_cal_raw_y_sum / g_cal_sample_count);
            g_cal_points[g_cal_index].screen_x = sx[g_cal_index];
            g_cal_points[g_cal_index].screen_y = sy[g_cal_index];
            g_cal_index++;
            hub_buzz(timer_get_ticks(), BUZZ_INPUT_MS);
        }
        if (g_cal_index < 4U) {
            touch_calibration_render();
        } else {
            stm32_touch_calibration_t cal;
            int r = touch_cal_solve(g_cal_points, 4, UI_RENDER_W,
                                    UI_RENDER_H, &cal);
            if (r == 0) {
                stm32_touch_set_calibration(&cal);
                if (stm32_sdfs_ready())
                    r = stm32_sdfs_save_touch_cal(&cal);
            }
            printf("[TOUCH] calibration %s save=%d\n",
                   r == 0 ? "complete" : "failed", r);
            g_cal_active = 0;
            touch_pressed = 0;
            g_cal_index = 0;
            g_ui_ready = 0;
            ui_render_full();
        }
    }
    g_cal_pressed = pressed;
}

static void update_wifi_display(void) {
#ifdef CONFIG_STM32_LEGACY_DASHBOARD
    const stm32_wifi_info_t *wifi = stm32_wifi_info();
    stm32_display_set_wifi(
        wifi->active, wifi->detected, wifi->at_responsive,
        wifi->configured, wifi->connecting, wifi->joined,
        wifi->got_ip, wifi->socket_connected, wifi->ssid,
        wifi->ip_address, wifi->mac_address, wifi->scan_ssid,
        wifi->access_points, wifi->baud_rate, wifi->received_bytes,
        wifi->transmitted_bytes, wifi->dropped_bytes,
        wifi->last_event);
#endif
}

static void update_memory_display(void) {
    stm32_memory_refresh();
#ifdef CONFIG_STM32_LEGACY_DASHBOARD
    stm32_display_set_memory(stm32_memory_info());
#endif
}

static void update_bluetooth_display(void) {
#ifdef CONFIG_STM32_LEGACY_DASHBOARD
    const stm32_bluetooth_info_t *bt = stm32_bluetooth_info();
    stm32_display_set_bluetooth(
        peripherals.bluetooth_ready, bt->detected, bt->at_responsive,
        bt->connected, bt->waiting, bt->configured,
        bt->slave_mode, bt->uuid_supported, bt->uuid_configured,
        bt->device_name, bt->pin[0] ? "configured" : "(unread)",
        bt->service_uuid, bt->baud_rate,
        bt->received_bytes, bt->transmitted_bytes, bt->dropped_bytes);
#endif
}

static void report_bluetooth(void) {
    const stm32_bluetooth_info_t *bt = stm32_bluetooth_info();
    static const char *const rx_states[] = {
        "unknown", "driven-high", "floating", "driven-low",
    };
    unsigned rx_state = (unsigned)bt->rx_line_state;
    if (rx_state >= sizeof(rx_states) / sizeof(rx_states[0]))
        rx_state = 0;

    printf("[BT] interface=%s detected=%s rx=%s at=%s"
           " role=%s state=%s name=%s pin=%s\n",
           bt->ready ? "armed" : "disabled",
           bt->detected ? "yes" : "no",
           rx_states[rx_state],
           bt->at_responsive ? "responsive" : "no-response",
           bt->slave_mode ? "slave" : "unknown",
           bt->waiting ? "slave-waiting" : "not-waiting",
            bt->device_name[0] ? bt->device_name : "(unread)",
            bt->pin[0] ? "configured" : "(unread)");
}

