fQwQf/A20OS/kernel/platform/stm32f103/peripherals.c
    peripherals.wifi_ready = stm32_wifi_init() == 0;
    printf("[BOOT] ESP8266 interface=%s uart=USART2/PA2/PA3"
           " enable=PC6 reset=PC7 baud=auto(115200-first)"
           " probe=deferred nonblocking\n",
           peripherals.wifi_ready ? "armed" : "disabled");

    const stm32_memory_info_t *memory = stm32_memory_info();
    peripherals.memory_capacity_from_silicon =
        memory->silicon_capacity_valid;
    printf("[BOOT] memory source=ram:%s flash:%s dev=0x%x rev=0x%x"
           " ram=%u/%u flash=%u/%u ext=%u/%u bytes\n",
           memory->ram_capacity_from_silicon ? "silicon" : "linked-layout",
           memory->flash_capacity_from_silicon ?
               "silicon" : "linked-layout",
           (unsigned)memory->device_id, (unsigned)memory->revision_id,
           (unsigned)memory->internal_ram_used,
           (unsigned)memory->internal_ram_total,
           (unsigned)memory->flash_used, (unsigned)memory->flash_total,
           (unsigned)memory->external_ram_used,
           (unsigned)memory->external_ram_total);

    /* Smart-hub sense/decide/act pipeline. */
    stm32_rtc_init();
    printf("[BOOT] RTC=%s (LSE preferred, LSI fallback)\n",
           stm32_rtc_available() ? "ready" : "fallback-time");
    dht_present = stm32_dht11_init() == 0;
    stm32_actuators_init();
    peripherals.rgb_matrix_ready = stm32_rgb_matrix_init() == 0;
    printf("[BOOT] RGB matrix=%s (WS2812B 5x5/PE5 brightness=%u/255)\n",
           peripherals.rgb_matrix_ready ? "ready" : "disabled",
           (unsigned)stm32_rgb_matrix_brightness());
    hub_controller_init(&hub_ctl);
    live2d_init(&g_cat);
    last_live2d_clock = stm32_live2d_frame_clock();
    g_last_speech[0] = '\0';
    have_env = 0;
    buzzer_active = 0;
    printf("[BOOT] smart-hub controller ready dht11=%s (PG11)"
           " actuators=fan(TIM3_CH1/PA6),pump(PA7),buzzer(PB8)\n",
           dht_present ? "armed" : "absent");
    ir_present = stm32_ir_init() == 0;
    ir_map_load_default();
    if (stm32_sdfs_ready()) {
        int bindings = ir_map_load_fs(stm32_sdfs(), "/CFG/IR.CFG");
        if (bindings >= 0)
            printf("[BOOT] IR map=/CFG/IR.CFG bindings=%d\n", bindings);
    }
    printf("[BOOT] IR receiver=%s (PB9/EXTI9, NEC) bindings=%u (%s)\n",
           ir_present ? "armed" : "absent", ir_map_count(),
           ir_map_count() ? "keys 1-9 live" : "NO KEYS BOUND");

    /*
     * wifi.c already owns USART2 and advances its AT probe from service().
     * Do not run the legacy synchronous esp8266.c probe here: it resets the
     * same UART and can hold boot before touch polling and buzzer shutdown.
     */
    printf("[BOOT] cloud control=nonblocking via wifi.c proxy=%s:%u"
           " (run `wifi join` then it auto-connects; `proxy <ip> <port>` to"
           " retarget)\n",
           cloud_proxy_ip, (unsigned)cloud_proxy_port);

    update_display_status();
    update_bluetooth_display();
    update_wifi_display();
    update_memory_display();
    update_light_display();
    hub_buzz(timer_get_ticks(), BUZZ_BOOT_MS); /* one startup chime */

    /*
     * Arm the watchdog only now — after the slow one-shot probes (bluetooth AT
     * scan, SD init) — so bring-up can't trip it. From here the service loop
     * must feed it within the timeout or the MCU resets.
     */
    stm32_watchdog_init(6000);
    printf("[BOOT] watchdog=%s (IWDG 6s)\n",
           stm32_watchdog_active() ? "armed" : "off");

    if (stm32_sdfs_ready()) /* one boot marker to /LOG/RUN.LOG */
        stm32_sdfs_log(timer_get_ticks(), "BOOT", "smart-hub up");

#ifndef CONFIG_STM32_LEGACY_DASHBOARD
    run_control_tick(timer_get_ticks());
    if (!touch_cal_loaded && peripherals.touch_armed)
        (void)stm32_peripherals_start_touch_calibration();
#endif
}

/*
 * Non-blocking cloud link over wifi.c: keep a TCP socket to the proxy open
 * (auto-connect once WiFi has an IP), drain incoming bytes, and reassemble
 * CONTROL frames into cloud_last. Runs every service tick.
 */
static void cloud_net_service(uint64_t now) {
    const stm32_wifi_info_t *w = stm32_wifi_info();
    if (!w->active || !w->got_ip) {
        cloud_rx_len = 0;
        cloud_awaiting = 0;
        return;
    }
    if (!w->socket_connected) {
        cloud_rx_len = 0;
        cloud_awaiting = 0;
        if (!w->command_busy && now >= cloud_connect_retry_at) {
            if (stm32_wifi_open("TCP", cloud_proxy_ip, cloud_proxy_port) == 0)
                printf("[NET] connecting proxy %s:%u\n", cloud_proxy_ip,
                       (unsigned)cloud_proxy_port);
            cloud_connect_retry_at = now + CLOUD_CONNECT_BACKOFF_MS;
        }
        return;
    }

    /* Drain the socket ring into the frame-reassembly buffer. */
    for (unsigned reads = 0; reads < 4U; reads++) {
        uint8_t chunk[64];
        int n = stm32_wifi_read(chunk, sizeof(chunk));
        if (n <= 0)
            break;
        for (int i = 0; i < n; i++) {
            if (cloud_rx_len == sizeof(cloud_rx))
                cloud_parse_frames(now);
            if (cloud_rx_len < sizeof(cloud_rx))
                cloud_rx[cloud_rx_len++] = chunk[i];
        }
        cloud_parse_frames(now);
    }

    if (cloud_awaiting && now >= cloud_reply_deadline)
        cloud_awaiting = 0; /* reply timed out; keep the socket, retry next tick */
}

/* Retarget the proxy at runtime (console `proxy <ip> <port>`); drops any open
 * socket so the next service reconnects to the new address. */
int stm32_peripherals_set_proxy(const char *ip, uint16_t port) {
    if (!ip || port == 0)
        return -1;
    size_t n = 0;
    while (ip[n] && n < sizeof(cloud_proxy_ip) - 1) {
        cloud_proxy_ip[n] = ip[n];
        n++;
    }
    if (ip[n]) /* address too long */
        return -1;
    cloud_proxy_ip[n] = '\0';
    cloud_proxy_port = port;
    cloud_last_valid = 0;
    cloud_awaiting = 0;
    cloud_rx_len = 0;
    cloud_connect_retry_at = 0;
    if (stm32_wifi_info()->socket_connected)
        stm32_wifi_close();
    printf("[NET] proxy set to %s:%u\n", cloud_proxy_ip,
           (unsigned)cloud_proxy_port);
    return 0;
}

void stm32_peripherals_request_time_sync(void) {
    cloud_ask_now = 1;
    last_control_tick = 0;
}

/* Latest assembled home-screen state + catgirl, for the on-board renderer. */
const ui_home_state_t *stm32_peripherals_ui_state(void) { return &g_ui_state; }
const live2d_t *stm32_peripherals_cat(void) { return &g_cat; }

/* Build an environment snapshot and drive the actuators from the decision. */
static void run_control_tick(uint64_t now) {
    env_snapshot_t s;
    int16_t t = last_temp_c;
    uint8_t h = last_humidity;
    int rtc_hour;
    int rtc_minute;
    int rtc_second;

    if (dht_present && stm32_dht11_read(&t, &h) == 0) {
        last_temp_c = t;
        last_humidity = h;
        have_env = 1;
        s.valid = 1;
    } else {
        /* No fresh reading: fail-safe path (rule engine holds + SENSOR). */
        s.valid = have_env ? 0 : 0;
    }
    s.temp_c = t;
    s.humidity = h;
    s.light = stm32_light_sensor_info()->intensity_percent;
    stm32_rtc_get_hhmmss(&rtc_hour, &rtc_minute, &rtc_second);
    (void)rtc_second;
    s.hour = (uint8_t)rtc_hour;

