fQwQf/A20OS/kernel/platform/stm32f103/peripherals.c
    if (peripherals.touch_armed &&
        now - last_touch_poll >= TOUCH_POLL_INTERVAL_MS) {
        uint16_t x = 0;
        uint16_t y = 0;
        last_touch_poll = now;
#ifdef CONFIG_STM32_LEGACY_DASHBOARD
        int pressed = stm32_touch_poll(&x, &y);
        stm32_display_show_touch(x, y, pressed);
        handle_display_actions();
#else
        if (g_cal_active) {
            touch_calibration_service();
            goto touch_done;
        }
        int pressed = stm32_touch_poll(&x, &y);
#endif
        if (pressed && !touch_pressed) {
            printf("[TOUCH] down x=%u y=%u\n", (unsigned)x, (unsigned)y);
#ifndef CONFIG_STM32_LEGACY_DASHBOARD
            touch_down_x = x;
            touch_down_y = y;
            touch_down_at = now;
            /* Light up whatever is under the finger right away; the repaint on
             * release clears it. Only the home page has hit outlines. */
            if (g_ui_ready && g_page == PAGE_HOME)
                ui_render_press(&g_ui_gfx, &g_ui_model, x, y);
#else
            hub_buzz(now, BUZZ_INPUT_MS); /* feedback chirp */
#endif
        }
        else if (!pressed && touch_pressed) {
            printf("[TOUCH] up\n");
#ifndef CONFIG_STM32_LEGACY_DASHBOARD
            int dx = (int)touch_last_x - (int)touch_down_x;
            if (g_page == PAGE_DIAG) {
                ui_diag_action_t da = ui_diag_hit_test(&g_diag_model,
                                                       touch_down_x,
                                                       touch_down_y);
                apply_diag_action(da, now);
            } else if (dx > 60 || dx < -60) {
                ui_apply_action(UI_ACTION_THEME_CYCLE, now);
            } else {
                /* A press that outlined a region always resolves to that same
                 * region's action, so the repaint below clears the outline. */
                ui_action_t act = ui_home_hit_test(&g_ui_model, touch_down_x,
                                                   touch_down_y);
                if (now - touch_down_at < TOUCH_LONG_PRESS_MS ||
                    !ui_release_manual(act, now))
                    ui_apply_action(act, now);
            }
#endif
        }
#ifndef CONFIG_STM32_LEGACY_DASHBOARD
        if (pressed) {
            touch_last_x = x;
            touch_last_y = y;
        }
#endif
        touch_pressed = pressed;
#ifndef CONFIG_STM32_LEGACY_DASHBOARD
touch_done:
        ;
#endif
    }

    if (peripherals.bluetooth_ready &&
        now - last_bluetooth_poll >= BLUETOOTH_POLL_INTERVAL_MS) {
        last_bluetooth_poll = now;
        int was_connected = peripherals.bluetooth_connected;
        stm32_bluetooth_service(now);
        peripherals.bluetooth_connected = stm32_bluetooth_connected();
        if (peripherals.bluetooth_connected != was_connected) {
            printf("[BT] link=%s\n",
                   peripherals.bluetooth_connected ? "connected" :
                                                     "disconnected");
            update_bluetooth_display();
        }

        int length;
        while ((length = stm32_bluetooth_read_line(
                    bluetooth_line, sizeof(bluetooth_line))) > 0) {
            (void)length;
            printf("[BT] authenticated command received (%u bytes)\n",
                   (unsigned)length);
#ifndef CONFIG_STM32_LEGACY_DASHBOARD
            ui_handle_bluetooth_command(bluetooth_line, now);
#endif
            stm32_display_show_bluetooth_line(bluetooth_line);
            update_bluetooth_display();
        }
    }

    if (peripherals.wifi_ready &&
        now - last_wifi_poll >= WIFI_POLL_INTERVAL_MS) {
        last_wifi_poll = now;
        const stm32_wifi_info_t before = *stm32_wifi_info();
        stm32_wifi_service(now);
        const stm32_wifi_info_t *after = stm32_wifi_info();
        if (before.phase != after->phase ||
            before.joined != after->joined ||
            before.got_ip != after->got_ip ||
            before.socket_connected != after->socket_connected ||
            before.access_points != after->access_points ||
            before.received_bytes != after->received_bytes ||
            before.transmitted_bytes != after->transmitted_bytes ||
            before.dropped_bytes != after->dropped_bytes)
            update_wifi_display();
        /*
         * One-shot join with credentials from the card, once the module is
         * responsive and idle (build-time SSID is empty by default).
         *
         * Gated on got_ip, not joined: the ESP8266 keeps the last AP in its own
         * flash and auto-rejoins at power-on, so it announces WIFI CONNECTED
         * (joined=1) before the firmware has asked for anything. The matching
         * WIFI GOT IP can be missed — it lands while the boot AT probe is still
         * mid-conversation — and then the board sits joined-with-no-IP forever
         * with nothing to recover it, because the old `!joined` gate treated the
         * module's own claim as proof. An IP is what cloud_net_service()
         * actually needs, and re-issuing CWJAP when already connected is
         * harmless.
         */
        if (boot_cfg.have_ssid && !cfg_join_attempted && after->at_responsive &&
            !after->got_ip && !after->connecting && !after->command_busy) {
            if (stm32_wifi_join(boot_cfg.ssid, boot_cfg.pass) == 0) {
                cfg_join_attempted = 1;
                printf("[NET] joining ssid=%s (from /CFG/WIFI.TXT)\n",
                       boot_cfg.ssid);
            }
        }
        cloud_net_service(now); /* keep the proxy socket + parse CONTROL */
    }

    if (now - last_memory_poll >= MEMORY_POLL_INTERVAL_MS) {
        last_memory_poll = now;
        update_memory_display();
    }

    if (peripherals.light_sensor_ready &&
        now - last_light_poll >= LIGHT_POLL_INTERVAL_MS) {
        uint64_t light_start = timer_get_ticks();
        last_light_poll = now;
        if (stm32_light_sensor_sample() != 0) {
            const stm32_light_sensor_info_t *light =
                stm32_light_sensor_info();
            printf("[LIGHT] ADC sample failed errors=%u\n",
                   (unsigned)light->errors);
        }
        update_light_display();
        record_max(&peripherals.light_max_ms, elapsed_ms(light_start));
    }

